from groq import Groq, RateLimitError, APIError
from config import config_obj

client = Groq(api_key=config_obj.grok_api_key)

MODELS_PRIORITY = [
    "llama-3.3-70b-versatile",
    "llama-3.1-8b-instant",
]


def load_andrey_context():
    return """
    Имя: Андрей
    Дата рождения: 10.06.1998 (27 лет)

    Образование: 
    - СЗГМУ (Северо-Западный государственный медицинский университет).
    - Специальность: Врач-лечебник.
    -
    Работа: 
    - Должность: AQA Engineer (автотестировщик).
    - Текущий проект: LEADS TECH.

    Личное:
    - Девушка: Лера (встречаются уже 8 лет).
    - Автомобиль: Audi A3.
    - Друзья: Друг Миша (тоже тестировщик).Данил - врач травмотолог-лохопед, 
    - Хобби: Аниме, Дота 2.
    - Любимая еда: шаурма.
    - Любимый напиток: энергетик, без сахара, black monster
    - Размер писюна: 50см
    - Родился в Белоруссии город Могилев
    - Прожил на севере 18 лет
    - Кот британская серебристая шиншила
    - Познакомиться со мной нельзя,занят Лерой Никоновой
    - 
    Контакт: @dreusus в телеграме.
    """


def get_answer_for_grok(user_prompt: str):
    context_data = load_andrey_context()

    system_instruction = f"""
    Ты — персональный AI-ассистент Андрея.
    [[ДАННЫЕ]]
    {context_data}
    [[КОНЕЦ]]
    Отвечай только на основе данных выше.
    """

    messages = [
        {"role": "system", "content": system_instruction},
        {"role": "user", "content": user_prompt}
    ]

    for model_name in MODELS_PRIORITY:
        try:
            print(f"🤖 Пробую модель: {model_name}...")

            response = client.chat.completions.create(
                messages=messages,
                model=model_name,
                temperature=0.3,
            )

            return response.choices[0].message.content

        except RateLimitError as e:
            print(f"⚠️ Лимит на {model_name} исчерпан! (Ошибка: {e})")
            print("🔄 Переключаюсь на следующую модель...")
            continue  # Идем к следующей модели в списке

        except APIError as e:
            print(f"❌ Ошибка API Groq: {e}")
            return "Упс, мозги нейросети временно недоступны. Попробуй позже."

    return "⛔️ К сожалению, все нейросети сейчас перегружены. Андрей слишком популярен!"
